{
    "teamleads": [
        {
          "name": "Tanvi Kapoor",
          "link": ""
        },
        {
          "name": "Andrew Chang",
          "link": ""
        }
    ],
    "advisors": [
      {
        "name": "Prof. Haym Hirsh",
        "link": "https://www.cs.cornell.edu/~hirsh/"
      }
    ],
    "about": "The Algorithmic Trading subteam focuses on using tools from computer science, mathematics, and statistics to study different areas of quantitative finance. We have previously worked on predicting asset prices through changes in SEC Filings, optimizing the rebalancing frequency for pension fund portfolios, and pricing orange juice futures using climate data.",
    "current": [
        {
            "title": "Portfolio Optimization: Generating Alpha via Diversifying Algorithms",
            "text": "It is no secret that diversification helps to hedge your portfolio, but we could also diversify our trading strategies to optimize our portfolio. The idea is that one algorithm performs better in certain contexts; for instance, an algorithm's expected return could be higher during certain time of the day or when trading a particular asset class. We aim to implement and optimize trading algorithms such as momentum strategies, mean reversion, and seasonality opportunities. We will then distribute money and baskets of assets to each algorithm to optimize our portfolio returns.",
            "link": ""
        },
        {
            "title" : "Predicting Implied Volatility Using Google Trends",
            "text" : "Using Google Trends data as a proxy for market sentiment, we hope to build a machine learning model that can take advantage of this data to accurately predict SPY options’ implied volatility for the next day, across multiple expiration dates and strike prices. We hope to use this model to build volatility based option trading strategies.",
            "link" : ""
        }
    ],
    "past": [
        {
            "title": "Orange Juice Futures",
            "text": "We analyzed the effects of precipitation, temperature, and other weather-related variables on the price of orange juice futures. Our goal was to find meaningful connections between the factors listed above and the orange futures prices using Florida weather data. Since Florida is the largest orange producer in the United States, our hypothesis was that abnormal weather patterns in the state, which produce suboptimal orange growth, will increase orange futures prices due to the lack of supply. After running several multivariate linear regression models, we found that although there were some statistically significant relationships between OJ futures prices and weather, weather data is best used as a supplement to many other market variables for predicting FCOJ futures prices and has no predictive power on its own.",
            "link": "https://github.coecis.cornell.edu/lfb46/AlgoTeamOrangesProject"
        },
        {
            "title": "Portfolio Rebalancing",
            "text": "Our goal was to create an optimized equity portfolio using the sectoral ETFs representing industry components of the S&P 500 index, by determining the weights each ETF should be assigned in the portfolio. We did this using the Hierarchical Risk Parity algorithm. We also investigated the optimum rebalancing frequency for maximizing returns.",
            "link": "https://github.com/Tanvikapoor14/cds-algo-sp21"
        },
        {
            "title": "ETF Correlation Network",
            "text": "Exchange Traded Funds (ETFs) are baskets of securities traded on exchanges with a mechanism to maintain the price of the basket close to the net asset value of the underlying. We hypothesized that as these bundles of securities are increasingly being traded on exchanges, the underlying securities are becoming artificially more similar. Focusing on the SPY ETF and using Mutual information, we generated MSTs (minimum spanning trees) that indicate that there exists a considerable degree of information that we can extrapolate from one security in the SPY ETF about other securities in the same basket."
        },
        {
            "title": "SEC Filings Text Analysis",
            "text": "Every quarter, publicly traded companies are required by the SEC to publish comprehensive reports (10-Ks and 10-Qs) about their financial performance. This project is based on a research paper called Lazy Prices in which the researchers hypothesize that analyzing the changes in wording and the overall sentiment of the Management Discussion & Analysis section of the 10-Q documents along with detecting mentions of C-level position changes would provide insight into the company’s future returns. In this project, we utilized cosine similarity and leveraged nltk’s sentiment analysis tool VADER to create features for classification models that attempted to predict whether a company’s future returns would be positive or negative."
        }
    ]
}   
