{
    "teamleads": [
    ],
    "advisors": [
    ],
    "about": "In addition to each of our subteam specific projects, we also take on many projects as an entire team. These are open to anyone regardless of subteam and usually incorporate many different aspects of software engineering, data science, and machine learning.",
    "current": [
        {
            "title": "The Bias Lab at Cornell",
            "text": "Machine learning is a once-in-a-generation technological shit that will transform how our society works. It’s even been described as the fourth industrial revolution; this advance is creating huge value by unlocking insights from data and touches almost every aspect of our lives from choosing the music we listen to, what vacation trips we take, and even who will get hired for their dream job. But algorithmic bias is still a major concern as these systems become even more widespread. Unless careful care is taken with these ML systems, they can have significant harmful impacts on underrepresented groups and lead to ineffective products. Our more technical objective is to explore these biases within a variety of models, and attempt to mitigate them. Beyond the technical material, we hope to educate our local community as much as possible to be knowledgeable and informed when discussing these problems along with potential solutions.",
            "link": ""
        },
        {
            "title": "Self Driving Car",
            "text": "CDS Self-Driving Car aims to demonstrate tight integration of a camera based vision algorithm to navigate a car safely. We utilize a SLAM system to localize ourselves, and an additional lane recognition pipeline to see the road. This is all built upon a Python control loop and will leverage robotics to directly actuate the steering wheel to augment a normal car.",
            "link": "https://github.com/CornellDataScience/self-driving-car"
        },
        {
            "title": "Coalescence ML",
            "text": "",
            "link": ""
        },
        {
            "title": "MyCourseIndex",
            "text": "",
            "link": ""
        } 
 
    ],
    "past": [
        {
            "title": "ProjectX",
            "text": "This was a cross-team collaboration project with members across Education, Insights, Data Engineering, and Intelligent Systems. The team was tasked with investigating epidemiology within a data science context. This culminated in a 7 page research paper submitted to the competition.",
            "link": "https://github.com/CornellDataScience/ProjectX-2021"
        }
    ]
}   
