{
    "teamleads": [
        {
            "name": "Varun Gande",
            "link": ""
        },
        {
            "name": "Emily Weed",
            "link": ""
        }
    ],
    "advisors": [
      {
        "name": "Prof. René Kizilcec",
        "link": "https://rene.kizilcec.com/"
      },
      {
        "name": "Prof. Mimno",
        "link": "https://mimno.infosci.cornell.edu/"
      }
    ],
    "about": "The Education Team manages the CDS student run course (INFO 1998: Intro to Machine Learning) as well as other community outreach events such as tech talks (past guests have included managers from Hilton, Facebook, and Munich RE). We also engage in disseminating data science information and knowledge through the creation of tutorials on our online repository. Our members also have the option of contributing to projects like the rest of the CDS teams, sprinkling our presence throughout various projects as well.",
    "current": [
        {
            "title": "Info 1998 - Intro to Machine Learning",
            "text": "This is a student run course that sets up students by teaching them fundamental machine learning concepts while giving them the opportunity to practice and create their own projects utilizing the knowledge we teach.",
            "link": "https://cornelldatascience.github.io/info1998/"
        },
        {
            "title": "Tutorials Project",
            "text": "Our team has been creating tutorials aiming to disseminate data science related knowledge to the public where current tutorials are deemed to be lacking",
            "link": "https://cornelldatascience.github.io/Education-Immersive-Tutorials/"
        }
    ],
    "past": [
        {
            "title": "ProjectX",
            "text": "This was a cross-team collaboration project with members across Education, Insights, Data Engineering, and Intelligent Systems. The team was tasked with investigating epidemiology within a data science context. This culminated in a 7 page research paper submitted to the competition.",
            "link": "https://github.com/CornellDataScience/ProjectX-2021"
        }
    ]
}   
