{
    "title" : "About",
    "description" : "We train students to think and work like data scientists so they can make meaningful contributions to data science projects. Our Training Program is a semester-long course that helps students develop an overarching understanding of data science, and our Deep Dives are shorter workshops that introduce students to the latest technologies that are shaping the world of data science.",
    "img": "education.jpeg",
    "imgText": "Education",
    "info" : [
        {
            "title" : "Intro to ML - INFO 1998",
            "link": "https://cornelldatascience.github.io/info1998/",
            "body" : "Big Data is growing, and by taking this course you'll gain hands-on experience in data analysis and prediction. Whether you're in finance, health care, business, agriculture, or software development, having data science skills is extremely helpful. Join the training program, and learn how to build your first ML model from real-world datasets! <br/><br/> <a href=\"https://cornelldatascience.github.io/info1998/\">View the course website</a>.",
            "img": "info1998_1.jpg"
        },
        {
            "title" : "Data Talks",
            "body" : "Each semester we invite industry professionals to come talk about their experience and advice. Open to anyone, students also get a chance to ask questions and learn what working in industry is like. In the past, we've hosted people from Meta, Amazon, MunichRE, and Hilton among others.",
            "img": "DataTalkFA21.jpg"
        },
        {
            "title" : "Blog",
            "link" : "https://cornelldatascience.github.io/education-blogs/",
            "body" : "Throughout the semester, we read many ML and Data Science related papers. Both in order to better understand them ourselves, and to help others understand them better we often write paper summaries and analysis. Occasionally, we also write posts about projects. <br/> <br/> <a href=\"https://cornell-data.medium.com\">Read our blog</a>.",
            "img": "home4.jpg"
        },
        {
            "title" : "Deep Dives",
            "body" : "Our Deep Dives are multi-part lectures covering important topics in ML and data science beyond simply a high level overview. We have two Deep Dives, one on Parallel Processing and another on Deep Learning, both of which are available on our <a href=\"https://www.youtube.com/channel/UCercrCT_cNiniURcPfGMmKw\">YouTube channel</a>. The resources for the Deep Learning lectures are available <a href=\"https://github.com/CornellDataScience/Deep-Learning-Course\">here</a>.",
            "img": "yujiDeepLearning.jpg"
        }
    ]
}
