{
    "description" : "Cornell Data Science (CDS) is an undergraduate project team which builds data-driven solutions to a variety of real-world problems. Current initiatives range from building an in-house self-driving car system to building an AI agent to play Super Smash Bros Ultimate. Our team of 92 students is a great place to meet people with diverse interests, gain experience at the intersection of theory and application, and contribute to the greater community initiatives.",
    "img": "oldhome1.jpg",
    "imgText": "Cornell Data Science",
    "info" : [
        {
            "title" : "Experience",
            "body" : "We work on projects that span the spectrum of data science. From applied deep learning to user-friendly visualizations, there is probably someone in CDS working on it.",
            "img": "home2.jpg",
            "linker": "recruitment"
        },
        {
            "title" : "Community",
            "body" : "CDS is more than just a team, its a community. In addition to our projects, we also regularly have team dinners, socials, and participate in other activities like IM sports.",
            "img": "volleyball_2.jpg",
            "linker": "teams"
        },
        {
            "title" : "Exposure",
            "body" : "We connect industry and passionate students together through our focus on data science. Come to our networking events, company talks, and mentoring sessions to learn more about careers in data science.",
            "img": "home4.jpg",
            "linker": "contact"
        }
    ],
    "people" : "Our members are the most important aspect of the team. From freshman to graduate students, our members come from five different colleges and numerous different majors. Come meet all 92 of us!",
    "education" : "Education is front and center to the team. We want to make data science accessible to all students at Cornell. Educating both our members and the general Cornell community is extremely important to us. Check out the course we teach, read our blog, attend our Data Talks, or watch our Deep Dives!",
    "sponsorHeader": "A special thanks to our sponsors:",
    "sponsorImages": ["google.png","meta.png","munichRE.png","mill-logo-white.svg","wayfair.png", "microsoft.png", "pfizer.png", "dataiku.png", "pandg.png", "blackrock.png", "ibm.png","carnival.png"]
}
