{
    "teamleads": [
        {
            "name": "Stephan Tse",
            "link": "https://github.com/st-tse"
        },
        {
            "name": "Phillip Si",
            "link": "https://github.com/ps789"
        }
    ],
    "advisors": [{
        "name": "Prof. Thorsten Joachims",
        "link": "https://www.cs.cornell.edu/people/tj/"
    }],
    "about": "We operate at the intersection of the latest research in machine learning and practical engineering to create useful products for society. Our work always has a strong outreach/user focus and a strong connection to machine learning. In addition to our numerous projects each semester, we also have weekly paper presentations where several members present a recent, or interesting paper to the rest of the subteam followed by a discussion. We also have a few tech talks throughout the semester which are lecture style talks on a useful topic related to ML. In the past this has ranged from an introduction to cloud computing, and a lecture on contextual bandits.",
    "current": [
        {
            "title": "Smash AI",
            "text": "Applying varying Reinforcement Learning approaches to the game of Super Smash Bros Melee",
            "link": "https://github.com/CornellDataScience/smash"
        },
        {
            "title": "InterpretML",
            "text": "Great progress has been made in developing complex, black-box models for prediction. However, how these models use feature information is often unclear, making them poorly suited for seeking to understand our world. On the other hand, simple linear models are prevalent through research due to their simple inference, yet make highly unrealistic assumptions. At InterpretML, we learn and investigate the frontier of interpretable models, those that maximize predictive power while remaining fully interpretable for the practitioner.",
            "link": "https://github.com/CornellDataScience/interpret-ml"
        },
        {
            "title": "WordRL",
            "text": "WordRL attacks the word sensation that's sweeping the nation Wordle, and is a reinforcement learning project for optimal Wordle play. We propose a variety of such reinforcement learning solutions, and compare our performance and predictions with information theory based optimal choices."
        },
        {
            "title": "Time Series Estimation for Stock Return Densities",
            "text": "Minute to minute stock returns vary a lot, but are more likely to be positive or negative depending on the day. We postulate that the distribution of returns for a given day can be modelled as a time varying probability distribution. To test this, we are using several time series and density estimation models to predict the distribution of log returns for the S&P500 index.",
            "link": "https://github.com/CornellDataScience/Stock-Densities"
        }
    ],
    "past": [
        {
            "title": "AI Economist",
            "text": "AI Economist is an exploratory project looking at potential extensions to a reinforcement learning-based approach to the problem of creating a more equitable and efficient tax system. The paper features a simplified simulated economy that allows agents to barter, trade, gather raw materials, and produce goods. We explored some minor expansions to the current environment as well as its limitations when training with a less powerful computer.",
            "link": "https://github.com/CornellDataScience/ai-economist"
        },
        {
            "title": "Dynamic Traffic",
            "text": "Dynamic Traffic Systems is Utilizing Graph Theory, Genetic Algorithms and Simulation to discover more effective traffic light signal programs. By simulating millions of possibilities and selecting the most effective traffic program under different conditions, we hope to reduce traffic headaches and carbon emissions alike.",
            "link": "https://github.com/CornellDataScience/Traffic"
        },
        {
            "title": "Poker Bot",
            "link": "https://github.com/CornellDataScience/PokerBot"
        },
        {
            "title": "Fairmandering: Redrawing fairer district lines",
            "text": "\"Fairmandering is the process of explicitly creating district maps with fair outcomes -- those that accurately reflect a state's political leanings, create enough competitive races to ensure accountability, and treat each party symmetrically. Fairmandering is made possible by a recent breakthough in redistricting technology. The basic idea is to repeatedly break up a state into smaller regions such that the pieces can fit together in an exponential number of ways. It is then efficient to filter out the thousands of fair maps from the trillions we create.\"",
            "link": "https://fairmandering.org/index.html"
        },
        {
            "title": "Forage",
            "text": "Forage is a platform for analyzing and forecasting urban trends with a focus on housing. The project has both a product component for doing data exploration on major US cities and an ML component using neighborhood embeddings to do short term forecasting. The goal is to provide academics and policy makers greater insight into local neighborhood trends to inform policy decisions."
        },
        {
            "title": "Pleio",
            "text": "Medication Non-adherence is a surprising problem throughout the US. With over 100,000 premature deaths and $300 M of avoidable health care costs all tied to non-adherence, Pleio has stepped in to help with their GoodStart program. This Project is dedicated to enabling their team better interact with individuals: from understanding what they feel, knowing when they are available, and why they end up refilling their prescription medications. We developed modules to de-identify audio and text data before working on a causal analysis of what interventions help individuals refill their medications.",
            "link": "https://github.com/bayoumi17m/audio-deidentification"
        },
        {
            "title": "Stanford Medical",
            "text": "Analyzing the correlation between county health data and mortality rates",
            "link": "https://github.com/jek343/StanfordMedical"
        },
        {
            "title": "AIR: Aerial Intelligence for Responders",
            "text": "Disasters happen, and they always will. While everyone on the planet is hit with the same kinds of disasters, to say that they are affected equally is negligent. In third world countries, some of whom might have poor cartographical systems of infrastructure, the problems of something like a hurricane is exacerbated by their physical inability to manage the wreckage. People are lost in the destruction, and with poor local mapping finding ways of navigating wreckage is infeasible. Introduce AIR. The AIR project is dedicated to enabling lower-income areas with efficient and automated mapping based on satellite or drone imagery. We have trained numerous deep learning models for translating images to class maps, where anyone can see where the roads, buildings, and other features are. Furthermore, our access to a large amount of different topological landscapes means we could train our models in different areas, and for specific instances of disasters the model that matches that topological area will perform the best rather than a one size fits all. Finally, we have built-in functionality for incorporating public access drone imagery in our model and have found success both for using that in the 'class-map' predictions, as well as a 'difference' heatmap that can show what areas of a map are most affected.",
            "link": "https://github.com/Dieblitzen/AIR-Project"
        },
        {
            "title": "Vocal Isolation",
            "text": "Separating sounds for storytelling",
            "link": "https://github.com/CornellDataScience/IntSys-Vocal-Isolation"
        },
        {
            "title": "Amazon Review Summarization: Clustering and autoencoders for review distillation",
            "text": "Evaluating potential purchases online is often made easier by reviews provided by other customers. However, sifting through hundreds of reviews to create a holistic view of the sentiment the product evokes can be time-consuming. We take two approaches to the problem: an extractive technique, where the review is generated from important sentences sampled from the corpus, and an abstractive technique, where we generate new text using an autoencoder that summarizes the original reviews.",
            "link": "https://github.com/CornellDataScience/IntSys-Sentiment-Summary"
        },
        {
            "title": "Seedlings",
            "text": "Creating a mobile application to classify maize seedlings and 11 different types of weed seedlings that are usually found growing in maize plots.",
            "link": "https://github.com/CornellDataScience/IntSys-Seedling"
        }
    ]
}   
