{
    "title" : "Recruitment",
    "description" : "Cornell Data Science is recruiting for Fall 2023! Please attend our information sessions on August 23rd and 24th to learn more and get any specific questions answered. All subteams are recruiting both freshmen and upperclassmen this semester! The full timeline is shown below.",
    "info" : [
        {
            "title" : "Info Sessions",
            "link" : "",
            "body" : "Information sessions will be held at 5:30pm on Wednesday, August 23rd, 2023 and Thursday, August 24th, 2023 in Phillips Hall, room 219. If you are unable to attend the info session, the slides will be posted here after the second info session."
        },
        {
            "title": "Coffee Chats",
            "body": "Feel free to reach out to any of the members listed <a href='https://docs.google.com/spreadsheets/d/1gLqKvgYazSFnEDy5LasHPEL7azSVsLO0tZ6QIPNBD_I/view?usp=sharing'>here</a> if you want to learn more about CDS, or fill out the coffee chat matching form <a href='https://docs.google.com/forms/d/e/1FAIpQLSco0OIFE4bxaG7di4NYBy13SxI97rYImdMHEEnxLIyt_-yt3Q/viewform'>here</a>!<br><br>Coffee chats are optional and not required to apply."
        },
        {
            "title" : "Application",
            "body" : "<b>All subteams are recruiting both freshmen and upperclassmen this semester</b> (Fall 2023). First, complete the <a href='https://cornell.ca1.qualtrics.com/jfe/form/SV_3dF2fjywuzGG1wi'>General Project Team Application</a> through the College of Engineering. Then, fill out the specific application for <a href='https://docs.google.com/forms/d/e/1FAIpQLScF1AnnxQmIxfF8-5eIuI1M9l98E8Ue5lrQTI4HWo85OcOQJA/viewform'>freshmen/transfers</a> or <a href='https://docs.google.com/forms/d/e/1FAIpQLScSH-YzencPqJSTYiQmVOsrVoW0fdZch9Aqh2OcasZsz0ymow/viewform'>upperclassmen</a>.<br><br>Applications are due <b>Thursday, August 31st for upperclassmen</b> and <b>Thursday, September 28th for freshmen and transfer students</b>. After the application review, selected candidates will be contacted to schedule interviews.<br><br>For more information on the project team application process, click <a href='https://www.engineering.cornell.edu/cornell-engineering-student-project-teams-join-a-team'>here</a>."
        },
        {
            "title" : "Interviews",
            "link" : "",
            "body" : "We will reach out to select applicants to conduct interviews over the following weeks. These will be both technical and behavioral. More information and interview materials will be sent to selected applicants."
        }
    ]
}