{
  "title": "Recruitment",
  "description": "Cornell Data Science is currently recruiting across all subteams for Spring 2024! Please attend our information sessions on January 29th and 30th to learn more and get any specific questions answered. The full timeline is shown below.",
  "info": [
    {
      "title": "Info Sessions",
      "link": "",
      "body": "Information sessions will be held at <b>5pm on Monday, January 29th, 2024</b> and <b>5pm on Tuesday, January 30th, 2024</b> in Gates G01. If you are unable to attend the info sessions, the slides will be posted here after the second info session."
    },
    {
      "title": "Coffee Chats",
      "body": "Feel free to reach out to any of the members listed <a href='https://docs.google.com/spreadsheets/d/1Od4XxfAaBpfs5BSg6kY4S3r23l29e4fvC43Sroinxg8/view?usp=sharing'>here</a> if you want to learn more about CDS!<br><br>Coffee chats are optional and not required to apply."
    },
    {
      "title": "Application",
      "body": "Data Engineering (DE), Machine Learning Engineering (MLE), and Quantitative Finance (QF) are recruiting both freshmen and upperclassmen this semester! Data Science (DS) is only recruiting freshmen. <br><br> First, complete the <a href='https://cornell.ca1.qualtrics.com/jfe/form/SV_3dF2fjywuzGG1wi'>General Project Team Application</a> through the College of Engineering. Then, fill out the <a href='https://forms.gle/4VwJ9EofG6T2cAAy5'>application form</a> for CDS.<br><br>Applications are due on <b>Thursday, February 1st at 11:59pm for freshmen and upperclassmen</b>. After the application review, selected candidates will be contacted to schedule interviews.<br><br>For more information on the project team application process, click <a href='https://www.engineering.cornell.edu/cornell-engineering-student-project-teams-join-a-team'>here</a>."
    },
    {
      "title": "Interviews",
      "link": "",
      "body": "We will reach out to select applicants to conduct interviews over the following weeks. These will be both technical and behavioral. More information and interview materials will be sent to selected applicants!"
    }
  ]
}
